CSI API ETABS v1

# cDConcSlabACI318_19 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDConcSlabACI318_19

    Public Interface cDConcSlabACI318_19

    Dim instance As cDConcSlabACI318_19

    public interface class cDConcSlabACI318_19

    type cDConcSlabACI318_19 =  interface end

The cDConcSlabACI318_19 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetPreference|  Retrieves the
value of a concrete slab design preference item
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com